case/sandiaD_LTS/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

# Phase 1: cold flow to 1500 (skipped if the 1500 restart directory exists)
if [ ! -d 1500 ]; then
    runApplication chemkinToFoam \
        chemkin/grimech30.dat chemkin/thermo30.dat chemkin/transportProperties \
        constant/reactionsGRI constant/thermo.compressibleGasGRI

    for src in system/controlDict.orig constant/chemistryProperties.orig 0/*.orig
    do
        [ -f "$src" ] || continue
        cp "$src" "${src%.orig}"
    done

    runApplication blockMesh
    runApplication setFields

    runApplication -a foamDictionary -entry "startTime"     -set "0"    system/controlDict
    runApplication -a foamDictionary -entry "writeInterval" -set "1500" system/controlDict
    runApplication -a foamDictionary -entry "endTime"       -set "1500" system/controlDict
    runApplication -a foamDictionary -entry "chemistry"     -set "off"  constant/chemistryProperties

    runApplication foamRun
fi

# Phase 2: reacting flow 1500 → 5000
runApplication -a foamDictionary -entry "startTime"     -set "1500" system/controlDict
runApplication -a foamDictionary -entry "writeInterval" -set "100"  system/controlDict
runApplication -a foamDictionary -entry "endTime"       -set "5000" system/controlDict
runApplication -a foamDictionary -entry "chemistry"     -set "on"   constant/chemistryProperties

runApplication foamRun

#------------------------------------------------------------------------------
