case/sandiaD_LTS/system/residuals
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O    peration   | Website:  https://openfoam.org
    \\    /     A nd         | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      residuals;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#includeEtc "caseDicts/functions/numerical/residuals.cfg"

fields (U p T CH4 O2 CO2 H2O CO OH k epsilon);

// ************************************************************************* //
