case/sandiaD_LTS/system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      sampleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Sampling at TNF Workshop comparison stations for Sandia Flame D.
//
// Geometry: z = axial, x = radial, D = 7.2e-3 m (nozzle diameter).
// Radial stations match pmD.stat reference files (D01..D60).
// Velocity stations match TUD_LDV_D.axial and TUD_LDV_D.d** files.

type        sets;
libs        (sampling);

writeControl    writeTime;

interpolationScheme cellPoint;

setFormat   raw;

fields      (U T CH4 O2 CO2 H2O CO OH H2 N2);

sets
{
    // Centerline: z = 0 to 500 mm (0 to ~69 D)
    centerline
    {
        type        lineUniform;
        axis        z;
        start       (0  0  0);
        end         (0  0  0.5);
        nPoints     501;
    }

    // Radial profiles at TNF x/D stations — x from axis to outer wall
    // z = n * D,  D = 0.0072 m

    radial_xD01
    {
        type        lineUniform;
        axis        x;
        start       (0     0  0.0072);
        end         (0.15  0  0.0072);
        nPoints     201;
    }

    radial_xD02
    {
        type        lineUniform;
        axis        x;
        start       (0     0  0.0144);
        end         (0.15  0  0.0144);
        nPoints     201;
    }

    radial_xD03
    {
        type        lineUniform;
        axis        x;
        start       (0     0  0.0216);
        end         (0.15  0  0.0216);
        nPoints     201;
    }

    radial_xD075
    {
        type        lineUniform;
        axis        x;
        start       (0     0  0.054);
        end         (0.15  0  0.054);
        nPoints     201;
    }

    radial_xD15
    {
        type        lineUniform;
        axis        x;
        start       (0     0  0.108);
        end         (0.15  0  0.108);
        nPoints     201;
    }

    radial_xD30
    {
        type        lineUniform;
        axis        x;
        start       (0     0  0.216);
        end         (0.15  0  0.216);
        nPoints     201;
    }

    radial_xD45
    {
        type        lineUniform;
        axis        x;
        start       (0     0  0.324);
        end         (0.15  0  0.324);
        nPoints     201;
    }

    radial_xD60
    {
        type        lineUniform;
        axis        x;
        start       (0     0  0.432);
        end         (0.15  0  0.432);
        nPoints     201;
    }
}

// ************************************************************************* //
