case/sandiaD_LTS/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultValues
{
    T   300;
    N2  0.77;
    O2  0.23;
    CH4 0;
}

zones
{
    fuel
    {
        type        box;

        box (0 -10 -100) (0.0036 10 0);

        values
        {
            CH4 0.1561;
            O2  0.1966;
            N2  0.6473;
        }
    }
}

// ************************************************************************* //
